Revit 2026 API

# MaterialSurfaceForegroundPatternId Property

---

The id of the FillPatternElement used as the foreground pattern of faces with this material in normal views.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId SurfaceForegroundPatternId { get; set; }
```
```vb
Public Property SurfaceForegroundPatternId As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ SurfaceForegroundPatternId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member SurfaceForegroundPatternId : ElementId with get, set
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The element id must represent a valid FillPatternElement. |
| ArgumentNullException | When setting this property: A non-optional argument was null |

The FillPattern used for a surface foreground pattern can have a 'Drafting' or a 'Model' target.

#### Reference

Material Class

Autodesk.Revit.DB Namespace